app/controllers/school_classes_controller.rb

  def create
    school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))  # create new instance with strong params
    school_class.save # persist to the database
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdf"], ["room_number", 0], ["created_at", "2021-03-22 20:21:35.959053"], ["updated_at", "2021-03-22 20:21:35.959053"]]

  def show
    @class = SchoolClass.find_by_id(params[:id])  # get class for show page
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @class = SchoolClass.find_by_id(params[:id])  # get class to fill out form_for values
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @class = SchoolClass.find_by_id(params[:id])  # find instance of class
    @class.update(params.require(:school_class).permit(:title, :room_number)) # update it with strong params
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "fix this"], ["room_number", 3], ["updated_at", "2021-03-22 20:39:25.364729"], ["id", 4]]