app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "asdf"], ["last_name", "asdf"], ["created_at", "2021-03-22 22:21:24.183291"], ["updated_at", "2021-03-22 22:21:24.183291"]]
---
  def create
    student = Student.new(params.require(:student).permit(:first_name, :last_name))
    student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "change"], ["last_name", "change"], ["updated_at", "2021-03-22 22:24:22.610699"], ["id", 4]]
---
  def update
    student = Student.find_by_id(params[:id])
    student.update(params.require(:student).permit(:first_name, :last_name))